In [173]:
import numpy as np
import pandas as pd

In [174]:
# Q1

In [175]:
#1-1
s1 = pd.Series([10, 20, 30, 40], 
            index=['a', 'b', 'c', 'd'])

s2 = pd.Series([50, 60, 70, 80], 
            index=['가', '나', '다', '라'])
s1, s2

(a    10
 b    20
 c    30
 d    40
 dtype: int64,
 가    50
 나    60
 다    70
 라    80
 dtype: int64)

In [176]:
#1-2
s1.describe()

count     4.000000
mean     25.000000
std      12.909944
min      10.000000
25%      17.500000
50%      25.000000
75%      32.500000
max      40.000000
dtype: float64

In [177]:
s2.describe()

count     4.000000
mean     65.000000
std      12.909944
min      50.000000
25%      57.500000
50%      65.000000
75%      72.500000
max      80.000000
dtype: float64

In [178]:
#Q.2
data = {
    '김씨':[80, 90, 70, 30, 50],
    '이씨':[90, 70, 60, 40, 10],
    '박씨':[90, 60, 80, 70, 60],
    '고씨':[80, 40, 60, 50, 90],
    '비고':[1.5, 5.2, 4.2, 7.2, 7.2]
    ,
    }
index = ['서울', '제주', '경기', '경상', '인천']
df = pd.DataFrame(data, index=index)
df

    김씨  이씨  박씨  고씨   비고
서울  80  90  90  80  1.5
제주  90  70  60  40  5.2
경기  70  60  80  60  4.2
경상  30  40  70  50  7.2
인천  50  10  60  90  7.2

In [179]:
#Q.3
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [180]:
#3-1
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [181]:
#3-2
df[['국어','영어']][:4]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [182]:
#3-3
df.mean(axis=1)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [183]:
#3-4
df['영어']['방자'] = 80
df.mean(axis=1)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [184]:
#3-5
df[['국어','영어', '수학']][:'춘향']

    국어  영어  수학
춘향  80  90  90

AttributeError: 'DataFrame' object has no attribute '향단'